app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails is Awesome!"], ["text", "It really is tho."], ["created_at", "2016-04-20 21:46:16.513886"], ["updated_at", "2016-04-20 21:46:16.513886"]]

    def update
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]